/*
1. 将三角形的图片转换成一个BASE64字符串
<img src="base64str" />

优点：可以按照自己的思想设计阴影，渐变等，然后对其进行转换编码。

缺点：
你需要使用一个图片编辑软件去设计
对于较大的图片，最终转换成字符串占用大小会很大
旧版本的浏览器，如：IE6/IE7是不兼容的


2.css border
优点:
很容易的通过修改一些CSS代码属性值而更改颜色和大小
这是一个跨浏览器的解决方案。

缺点:
这个方式使用的是border,所以你不能添加阴影、渐变、和其他一些CSS3效果
请记住，IE6是不支持透明边界的-如果你关心这个问题
如果你使用火狐浏览器，要知道，CSS的“透明”有时可能不会是透明的，特别是在对角线边框.

3.html字符

它是基于使用可用的Unicode字符列表的字符。

优点：
它是一个跨浏览器的技术
您可以使用CSS3的text-shadow属性添加阴影。
缺点：
不能使用太多的CSS3效果，除了使用文字阴影。
在所有的浏览器，这是相当不可能实现像素完美。

4.css旋转正方形

优点
CSS3阴影，渐变等可以更多的使用
缺点
这个解决方案不是跨浏览器的,首先是因为CSS3旋转。
*/